tap "adembc/tap"
tap "ddev/ddev"
tap "elastic/tap"
tap "felixkratz/formulae"
tap "gromgit/brewtils"
tap "homebrew/services"
tap "localazy/tools"
tap "nikitabobko/tap"
tap "owloops/tap"
tap "stripe/stripe-cli"
tap "thezoraiz/ascii-image-converter"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Command-line interface for SQLite
brew "sqlite"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Reactive CLI that generates commit messages for Git and Jujutsu with AI
brew "aicommit2"
# Library for manipulating PNG images
brew "libpng"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# High performance key/value database
brew "berkeley-db"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Vector graphics library with cross-device output support
brew "cairo"
# Scan for endpoints, secrets, API keys, file extensions, tokens and more
brew "cariddi"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Statistics utility to count lines of code
brew "cloc"
# Console Matrix
brew "cmatrix"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Power of curl, ease of use of httpie
brew "curlie"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Library access to GnuPG
brew "gpgme"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Cross-platform TUI database management tool
brew "lazysql"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Implementation of the file(1) command
brew "libmagic"
# Postgres C API library
brew "libpq"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Powerful, lightweight programming language
brew "lua"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Highly capable, feature-rich programming language
brew "perl"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Draw UML diagrams
brew "plantuml"
# Paste PNG into files
brew "pngpaste"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Generic machine emulator and virtualizer
brew "qemu"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Command-line utility for SQLx, the Rust SQL toolkit
brew "sqlx-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Cross-platform library for building Telegram clients
brew "tdlib"
# Feature rich terminal file transfer and explorer
brew "termscp"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Yet another typing test, but crab flavoured
brew "toipe"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Simple terminal image viewer written in Rust
brew "viu"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A simple terminal UI for managing SSH connections.  
brew "adembc/tap/lazyssh"
# DDEV
brew "ddev/ddev/ddev"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# CLI tool for the Localazy platform
brew "localazy/tools/localazy", link: false
# Uptime monitoring CLI tool with alerting and advanced settings
brew "owloops/tap/updo"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Convert images into ascii art
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Terminal-based AI coding assistant
cask "claude-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Digital logic designer and simulator
cask "logisim-evolution"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
go "github.com/air-verse/air"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/spf13/cobra-cli"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/abice/go-enum"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "golang.org/x/tools/gopls"
go "golang.org/x/tools/cmd/gorename"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "go.uber.org/mock/mockgen"
go "github.com/kyoh86/richgo"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/vanny2000/todo-cli"
cargo "budget_tracker_tui"
